<a href="https://colab.research.google.com/github/kiplangat-david/IP-WEEK-3/blob/main/ipwk3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import csv

1.LOAD ALL DATASETS

In [ ]:
#cells_geo dataset
cells_geo = pd.read_csv('cells_geo.csv', delimiter = ';')
cells_geo.head(3)
cells_geo = pd. DataFrame(cells_geo)
cells_geo.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [ ]:
#cdr_description data
cdr = pd.read_excel('CDR_description.xlsx')
cdr.head

<bound method NDFrame.head of        Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String>

In [ ]:
#cells_geo_description data
cells_geo_description = pd.read_excel('cells_geo_description.xlsx')
cells_geo_description

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
#telcom dataset 1
t_d1 = pd.read_csv('http://bit.ly/Telcom_dataset1')
t_d1.head(3)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 10 columns]

In [ ]:
#telcom dataset2
t_d2 = pd.read_csv('http://bit.ly/Telcom_dataset2')
t_d2.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q

[3 rows x 10 columns]

In [ ]:
#telcom dataset3
t_d3 = pd.read_csv('Telcom_dataset3.csv')
t_d3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]


**Clean datasets by removing irrelevant information**

In [ ]:
#dataset one
#pick relevant columns
t_d1 = t_d1[['PRODUTC','VALUE', 'DATETIME', 'DW_A_NUMBER', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']]
t_d1.head()

KeyError: ignored

In [ ]:
t_d1.columns = ['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']
t_d1.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv

[5 rows x 7 columns]

In [ ]:
#dataset 2
#pick relevant columns
t_d2 = t_d2[['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER', 'DW_B_NUMBER', 'CELL_ID','SITE_ID']]
t_d2.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q
3   Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  ...  +bO+qkSonO  +bO+qkSonO

[5 rows x 7 columns]

In [ ]:
#RENAMING DATASET2
t_d2.columns = ['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']
t_d2.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q
3   Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  ...  +bO+qkSonO  +bO+qkSonO

[5 rows x 7 columns]

In [ ]:
#DATASET3
t_d3 = t_d3[['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELLID','SIET_ID']]
t_d3.head()

  PRODUCT  VALUE  ...      CELLID     SIET_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA

[5 rows x 7 columns]

In [ ]:
#RENAMING DATASET 3
t_d3.columns = ['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']
t_d3.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA

[5 rows x 7 columns]

  MERGING DATASETS 1,2,3

In [ ]:
#CONCAT datasets1,2,3,
t_d4 = pd.concat((t_d1, t_d2,t_d3), axis=0, ignore_index=True)
t_d4

      PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0       Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1         sms      0  ...  /+cKZKIp41  /+cKZKIp41
2         sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3       Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4       Voice     14  ...  051KhYDCpv  051KhYDCpv
...       ...    ...  ...         ...         ...
14998   Voice      0  ...  2aa04dcab7  f7d63a29e5
14999   Voice     62  ...  7f1f2f889f  b4ddb9e93c
15000   Voice     32  ...  a4731e780e  d68260ef50
15001   Voice     30  ...  98ed726da2  b4130b54ab
15002   Voice     60  ...  1c11a2fcbb  6d70dae094

[15003 rows x 7 columns]

**MERGING t_d4 with cells_geo data**

In [ ]:
telecom = t_d4.merge(cells_geo, how='outer', on='CELL_ID')
telecom.head()

  PRODUCT  VALUE              DATE_TIME  ... REGION AREA SITE_CODE
0   Voice    0.0  2012-05-06 23:04:37.0  ...    NaN  NaN       NaN
1     sms    0.0  2012-05-06 23:40:48.0  ...    NaN  NaN       NaN
2     sms    0.0  2012-05-07 23:32:47.0  ...    NaN  NaN       NaN
3     sms    0.0  2012-05-07 23:52:21.0  ...    NaN  NaN       NaN
4    data    0.0  2012-05-07 23:53:21.0  ...    NaN  NaN       NaN

[5 rows x 18 columns]

In [ ]:
telecom.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18977 entries, 0 to 18976
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          15003 non-null  object
 1   VALUE            15003 non-null  float64
 2   DATE_TIME        15003 non-null  object
 3   DW_A_NUMBER_INT  15003 non-null  object
 4   DW_B_NUMBER_INT  15003 non-null  object
 5   CELL_ID          18977 non-null  object
 6   SITE_ID          13006 non-null  object
 7   Unnamed: 0       3974 non-null   float64
 8   VILLES           3974 non-null   object
 9   STATUS           3907 non-null   object
 10  LOCALISATION     3974 non-null   object
 11  DECOUPZONE       3974 non-null   object
 12  ZONENAME         3968 non-null   object
 13  LONGITUDE        3974 non-null   float64
 14  LATITUDE         3974 non-null   float64
 15  REGION           3974 non-null   object
 16  AREA             3951 non-null   object
 17  SITE_CODE        3974 non-null   object
dtypes: float64(4), object(14)
memory usage: 2.8+ MB

**DATA ANALYSIS**

In [ ]:
telecom.describe()

              VALUE   Unnamed: 0    LONGITUDE     LATITUDE
count  15003.000000  3974.000000  3974.000000  3974.000000
mean      25.548690  1986.500000    -4.877659     6.244749
std      152.916219  1147.339313     1.300771     1.304199
min        0.000000     0.000000    -8.503889     0.000000
25%        0.000000   993.250000    -5.846139     5.338639
50%        0.000000  1986.500000    -4.084500     5.475000
75%       25.000000  2979.750000    -3.993444     6.872306
max    12900.000000  3973.000000    -0.000000    10.481861

In [ ]:
telecom.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18977 entries, 0 to 18976
Data columns (total 19 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          15003 non-null  object
 1   VALUE            15003 non-null  float64
 2   DW_A_NUMBER_INT  15003 non-null  object
 3   DW_B_NUMBER_INT  15003 non-null  object
 4   CELL_ID          18977 non-null  object
 5   SITE_ID          13006 non-null  object
 6   Unnamed: 0       3974 non-null   float64
 7   VILLES           3974 non-null   object
 8   STATUS           3907 non-null   object
 9   LOCALISATION     3974 non-null   object
 10  DECOUPZONE       3974 non-null   object
 11  ZONENAME         3968 non-null   object
 12  LONGITUDE        3974 non-null   float64
 13  LATITUDE         3974 non-null   float64
 14  REGION           3974 non-null   object
 15  AREA             3951 non-null   object
 16  SITE_CODE        3974 non-null   object
 17  DATE             15003 non-null  object
 18  TIME             15003 non-null  object
dtypes: float64(4), object(15)
memory usage: 3.5+ MB

**the most used city during the 3 days**

**cities used the MTN products the most over the three days**

In [ ]:

#cells_geo['VILLES'].count() 

telecom.groupby('VILLES')['VILLES'].count().sort_values(ascending = False )

VILLES
COCODY         354
YOPOUGON       295
ABOBO          255
MARCORY        141
TREICHVILLE    132
              ...
LOUGBONON        3
MEMNI            2
KOTOULA          2
OUANGOLO         1
DANANON          1
Name: VILLES, Length: 504, dtype: int64

cocody used the most
yopougo,abobo,marcory,treichville are also among top cities that used MTN products

**product most used product**

In [ ]:
telecom.groupby(['PRODUCT'])['VALUE'].count()

PRODUCT
Voice    5666
data     2266
sms      7071
Name: VALUE, dtype: int64

regions which used MTN the most

In [ ]:
telecom.groupby(['REGION', 'PRODUCT'])['PRODUCT'].count().sort_values(ascending = False)

Series([], Name: PRODUCT, dtype: int64)

**product with higher revenue**

In [ ]:

telecom.groupby(['PRODUCT'])['VALUE'].count()

PRODUCT
Voice    5666
data     2266
sms      7071
Name: VALUE, dtype: int64

**Area which used the MTN products the most and which product **

In [ ]:
telecom.groupby(['AREA', 'PRODUCT'])['PRODUCT'].count().sort_values(ascending = False)

Series([], Name: PRODUCT, dtype: int64)